Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_SwiftProgrammingLanguage_ePub5.2/Swift_ePub_SPL-omegat.tmx
Source language: en_us
Languages: ja

source: The return type can be any type.
ja: 戻りの型は任意の型であることができます。

source: The return type can include types that are part of the function’s generic type parameters.
ja: 戻り型は、関数のもつ総称体型パラメータの一部である型を定義含むことができます。

source: The return type of makeIncrementer is () -> Int.
ja: makeIncrementerの戻り型は、() -> Intです。

source: The return value of john.residence?.address?.street is therefore also String?, even though two levels of optional chaining are applied in addition to the underlying optional type of the property.
ja: john.residence?.address?.streetの戻り値は、したがってまた、String?です、その下のプロパティのオプショナル型に加えて２つのオプショナル連鎖の階層が適用されるとしてもです。

source: The return value of a function can be ignored when it is called:
ja: 関数の戻り値は、それが呼ばれるとき無視されることができます：

source: The returned array value is stored in boardColors and can be queried with the squareIsBlackAt(row:column:) utility function:
ja: 返された配列値は、boardColorsに格納されて、便利な支援関数のsquareIsBlackAt(row:column:)で問い合わされることができます：

source: The revised version of the code returns an instance of Square or an instance of FlippedShape, depending on what shape is passed in.
ja: この改訂版のコードは、SquareのインスタンスまたはFlippedShapeのインスタンスを返します、どの形状が渡されるかに依存して。

source: The role of printMathResult(_:_:_:) is to print the result of a call to a math function of an appropriate type.
ja: printMathResult(_:_:_:)の役割は、適切な型の数学関数に対する呼び出しの結果を出力することです。

source: The row height should be 50 points taller than the content height if the row has a header, and 20 points taller if the row doesn’t have a header:
ja: 列の高さは、列にヘッダがあるならば内容の高さより50ポイント高く、列にヘッダがないならば20ポイント高くなければなりません：

source: The rules for combining numeric constants and variables are different from the rules for numeric literals.
ja: 数の定数や変数を結合することに対する規則は、数のリテラルに対する規則と異なります。

source: The rules for how initializer delegation works, and for what forms of delegation are allowed, are different for value types and class types.
ja: どのようにイニシャライザ委任が働くか、そしてどんな委任の形式が許されるかの規則は、値型とクラス型で異なります。

source: The rules of the game are as follows:
ja: ゲームの規則は、次の通りです：

source: The rules only affect how you write the implementation of the class’s initializers.
ja: これらの規則は、あなたがクラスのイニシャライザの実装を書く方法に影響を及ぼすだけです。

source: The same behavior applies to enumerations:
ja: 同じ挙動は、列挙にもあてはまります：

source: The same is not true for classes, which are reference types.
ja: 同じことはクラスにはあてはまりません、それは参照型です。

source: The same is true for method parameters, because methods are just functions that are associated with a type.
ja: 同じことはメソッドパラメータにもあてはまります、なぜならメソッドは、あるひとつの型に結び付けられた単なる関数だからです。

source: The same is true if you attempt to set a property through optional chaining.
ja: 同じことは、あなたがプロパティをオプショナル連鎖を通して設定しようと試みる場合にも当てはまります。

source: The same method is applied when calculating the remainder for a negative value of a:
ja: 同じメソッドが、負の値のaのための余りを計算するとき適用されます：

source: The same value can appear in an array multiple times at different positions.
ja: 同じ値は、ひとつの配列の中で複数回異なる位置で現れることができます。

source: The scope of a labeled statement is the entire statement following the statement label.
ja: ラベルをつけられた文のスコープは、文ラベルに続いている文全体です。

source: The scope of each case can’t be empty.
ja: それぞれのケース節のスコープは、空であることはできません。

source: The second Rect initializer, init(origin:size:), is functionally the same as the memberwise initializer that the structure would have received if it did not have its own custom initializers.
ja: 二番目のRectイニシャライザ、init(origin:size:)は、構造体が独自のあつらえのイニシャライザを持たない場合に受け取る省略時のメンバー関連イニシャライザと機能的に同じものです。

source: The second and third parameters are called a and b, and are both of type Int.
ja: ２番目と３番目のパラメータはaとbと呼ばれます、そして両方ともInt型です。

source: The second block is then closed, followed by the first block:
ja: 第二のブロックはそれから閉じられます、そして最初のブロックが続きます：

source: The second class in the hierarchy is a subclass of Food called RecipeIngredient.
ja: この階層構造における第二のクラスは、RecipeIngredientと呼ばれるFoodのサブクラスです。

source: The second form emits the warning message as a nonfatal warning and allows compilation to proceed.
ja: ２番目の形式は、warning message（警告メッセージ）を致命的でない警告として発して、コンパイルの続行を許します。

source: The second form evaluates to the value of the type.
ja: 第二の形式は、型の値に評価されます。

source: The second form is used to access the superclass’s subscript implementation.
ja: 第２の形式は、スーパークラスの添え字実装にアクセスするために使われます。

source: The second form of a line control statement, #sourceLocation(), resets the source code location back to the default line numbering and filename.
ja: ２番目の形式の行制御文、#sourceLocation()はソースコード位置を再設定して、初期状態の行番号振りとファイル名に戻します。

source: The second form of an if statement provides an additional else clause (introduced by the else keyword) and is used for executing one part of code when the condition is true and another part of code when the same condition is false.
ja: if文の２番目の形式は、追加のelse節（代わりの節）を提供します（elseキーワードで導入されます）、そして条件が真である場合はあるコード部分を、そして同じ条件が偽である場合は別のコード部分を実行するために使われます。

source: The second function, printWithoutCounting(string:), calls the first function, but ignores its return value.
ja: 第二の関数、printWithoutCounting(string:)は、最初の関数を呼びます、しかしその戻り値を無視します。

source: The second initializer has a single initialization parameter with an argument label of fromKelvin and a parameter name of kelvin.
ja: 第二のイニシャライザは、fromKelvinの引数ラベルとkelvinのパラメータ名を使うただ１つの初期化パラメータを持ちます。

source: The second is a convenience type function called isUnlocked(_:), which returns true if a particular level number is already unlocked.
ja: 第二は、isUnlocked(_:)と呼ばれる便利な型関数です、それは、特定のレベル番号がすでに錠を開けられるならば、trueを返します。

source: The second kind of pattern is used for full pattern matching, where the values you’re trying to match against may not be there at runtime.
ja: 2番目の種類のパターンは、完全なパターンマッチングのために使われます、そこにおいてあなたがマッチを試みている対象である値は実行時にそこにないかもしれません。

source: The second pair has a key of "DUB" and a value of "Dublin".
ja: ２番目の組みは、"DUB"のキーと"Dublin"の値を持ちます。

source: The second situation is when you implicitly inherit from the same protocol multiple times.
ja: 第二の状況は、あなたが暗黙的に同じプロトコルから複数回継承する時です。

source: The second subclass, Song, adds an artist property and initializer on top of the base class:
ja: 第二のサブクラスSongは、基盤クラスの上にartistプロパティとイニシャライザを加えます：

source: The second type parameter, U, has a type constraint that requires U to conform to the protocol SomeProtocol.
ja: ２番目の型パラメータUは、UにプロトコルSomeProtocolに準拠することを要求する型制約を持ちます。

source: The second type property is a variable stored property called maxInputLevelForAllChannels.
ja: 第二の型プロパティは、maxInputLevelForAllChannelsと呼ばれる変数格納プロパティです。

source: The self Property
ja: selfプロパティ

source: The sequence being iterated over is a range of numbers from 1 to 5, inclusive, as indicated by the use of the closed range operator (...).
ja: それに対して繰り返しを行われている連続物（シーケンス）は、完結範囲演算子（...）の使用によって示されるように、1から5までを含める数からなる範囲です。

source: The sequence method is declared with the warn_unqualified_access attribute to help reduce confusion when attempting to use one or the other from within a Sequence extension.
ja: シーケンスメソッドは、warn_unqualified_access属性で宣言されることで、あるSequence拡張内部から一方または他方を使おうと試みる場合に混乱を減じる助けとします。

source: The server either responds with the requested information, or it responds with a description of what went wrong.
ja: そのサーバーは要請された情報で応答するか、またはそれは何がうまくいかなかったかの説明で応答するかのどちらかです。

source: The setter clause is optional, and when only a getter is needed, you can omit both clauses and simply return the requested value directly, as described in Read-Only Computed Properties.
ja: セッター節は任意です、そして、ゲッターだけが必要なとき、あなたは両方の節を省略することができます、そして読み出し専用の計算プロパティで記述されるように、単に直接に要請された値を返すことができます。

source: The setter clause is optional, and when only a getter is needed, you can omit both clauses and simply return the requested value directly.
ja: セッター節は任意です、そしてゲッターだけが必要なとき、あなたは両方の節を省略して、単に直接要請された値を返すことができます。

source: The setter ensures that new values are less than 12, and the getter returns the stored value.
ja: セッターは、新しい値が12より少ないことを保証します、そしてゲッターは格納された値を返します。

source: The shifting behavior is more complex for signed integers than for unsigned integers, because of the way signed integers are represented in binary.
ja: シフト挙動は、符号つき整数では符号なし整数よりももっと複雑です、なぜなら、符号つき整数が２進数において表される方法のためです。

source: The shorthand syntax for available attributes concisely expresses availability for multiple platforms.
ja: available属性のための略記構文は、複数のプラットホームに対する有効性を簡潔に表します。

source: The sign bit is 0 (meaning “positive”), and the seven value bits are just the number 4, written in binary notation.
ja: 符号ビットは0です（「正」を意味します）、そして７つの値ビットはちょうど、２進数表記法で書かれる数4です。

source: The sign of b is ignored for negative values of b.
ja: bの符号は、負の値のbのために無視されます。

source: The sign of a numeric value can be toggled using a prefixed -, known as the unary minus operator:
ja: 数の値の符号は、単項マイナス演算子として知られる、接頭辞-を使うことによって切り換えられることができます：

source: The simplest entry in a parameter list has the following form:
ja: パラメータ・リストの中の最も単純な項目は、以下の形式を持ちます：

source: The simplest form of initializer syntax uses the type name of the class or structure followed by empty parentheses, such as Resolution() or VideoMode().
ja: イニシャライザ構文の最も単純な形式は、クラスまたは構造体の型名を使用して、それに空の丸括弧を続けます、例えばResolution()またはVideoMode()のように。

source: The single type parameter for findIndex(of:in:) is written as T: Equatable, which means “any type T that conforms to the Equatable protocol.”
ja: findIndex(of:in:)のただ１つの型パラメータは、T: Equatableとして書かれます、それは、「何らかの型TでEquatableプロトコルに準拠するもの」を意味します。

source: The sorting closure needs to return true if the first value should appear before the second value, and false otherwise.
ja: このソートを行うクロージャは、最初の値が第２の値の前に現れるべきならばtrueを、そうでないならばfalseを返す必要があります。

source: The specialized version of the generic Dictionary type, Dictionary<String, Int> is formed by replacing the generic parameters Key: Hashable and Value with the concrete type arguments String and Int.
ja: 総称体Dictionary型の特殊化版、Dictionary<String, Int>は、総称体パラメータKey: HashableおよびValueを具象型引数StringおよびIntと置き換えて作り上げられます。

source: The specific implications of this guiding principle for different aspects of the language are covered in detail below.
ja: この言語の異なる面に対する、この原理指針の特定の影響は、詳細に下で扱われます。

source: The specific kinds of Swift code that use long-term accesses are discussed in the sections below.
ja: 特定の種類のスウィフトコードでそれら長期アクセスを使うものは、下の節で議論されます。

source: The stack now holds four values, with the most recent one at the top.
ja: スタックは現在は４つの値を持ちます、最も最近のものは一番上にあります。

source: The standard library provides pointer and buffer types that you can use if you need to interact with pointers directly—see Manual Memory Management [https://developer.apple.com/documentation/swift/swift_standard_library/manual_memory_management].
ja: 標準ライブラリは、ポインタとバッファ型を提供します、それはあなたが直接にポインタと相互作用する必要があるならばあなたが使用できます — 手動メモリ管理 [https://developer.apple.com/documentation/swift/swift_standard_library/manual_memory_management]を見てください。

source: The start of the closure’s body is introduced by the in keyword.
ja: クロージャのもつ本文の始まりは、inキーワードで紹介されます。

source: The statement if let somePlanet = Planet(rawValue: 11) creates an optional Planet, and sets somePlanet to the value of that optional Planet if it can be retrieved.
ja: 文if let somePlanet = Planet(rawValue: 11)は、オプショナルのPlanetを作成して、それが取り出されることができるならば、somePlanetをそのオプショナルのPlanetのもつ値に設定します。

source: The statements in the defer statement can’t transfer program control outside of the defer statement.
ja: defer文の中の文は、プログラムの制御をdefer文の外側に移すことはできません。

source: The statements within the defer statement are executed no matter how program control is transferred.
ja: defer文内の文は、どのようにプログラム制御が移されようと関係なく実行されます。

source: The static method is a member of one of the types whose values the operator takes as an argument—for example, an operator that multiplies a Double by an Int is implemented as a static method on either the Double or Int structure.
ja: この静的メソッドは、その演算子が引数としてとる値の型のうちの１つに属するあるメンバーです、例えばDoubleにIntを掛ける演算子は静的メソッドとしてDoubleまたはInt 構造体のどちらかで実装されます。

source: The stored or computed nature of an inherited property is not known by a subclass—it only knows that the inherited property has a certain name and type.
ja: 継承されたプロパティの格納または計算の種別は、サブクラスには知られません ― それは、継承されたプロパティが特定の名前と型を持つということを知っているだけです。

source: The string "123" can be converted into the numeric value 123, but the string "hello, world" doesn’t have an obvious numeric value to convert to.
ja: 文字列"123"は数の値123に変えられることができます、しかし文字列"hello, world"には変えるための明らかな数の値がありません。

source: The string begins on the first line after the opening quotation marks (""") and ends on the line before the closing quotation marks, which means that neither of the strings below start or end with a line break:
ja: 文字列は、開始引用符（"""）の後の最初の行で始まって終了引用符の前の行で終わります、それが意味するのは下の文字列のどちらも改行で始まったり終わったりしないということです。

source: The string retrieved from the digitNames dictionary is added to the front of output, effectively building a string version of the number in reverse.
ja: digitNames辞書から取り出される文字列はoutputの前方に加えられて、うまい具合に数の文字列版を逆の順序で造ります。

source: The string-sorting closure from the Closure Expression Syntax section above can be written outside of the sorted(by:) method’s parentheses as a trailing closure:
ja: 上のクロージャ式構文の節の文字列を分類するクロージャは、後付クロージャとしてsorted(by:)関数の括弧の外側に書かれることができます：

source: The strong reference cycle prevents the Person and Apartment instances from ever being deallocated, causing a memory leak in your app.
ja: 強い参照循環はPersonとApartmentインスタンスがともかく割り当て解除されるのを妨げます。そして、あなたのアプリのメモリリークを引き起こします。

source: The strong references between the Person instance and the Apartment instance remain and cannot be broken.
ja: PersonインスタンスとApartmentインスタンスの間の強い参照は、残っていて、壊されることができません。

source: The strong references from the two variables (john and unit4A) and the links between the two instances are created as before:
ja: ２つの変数（johnとunit4A）からの強い参照と２つのインスタンスの繋がりは、前の通り作成されます：

source: The structure also defines a stored integer property called numberOfEdits, which is used to track the number of times that value is modified.
ja: この構造体はまた、numberOfEditsと呼ばれる格納整数プロパティを定義します、それは、valueが修正される回数を追跡するために使われます。

source: The structure defines a single initializer, init, with no parameters, which initializes the stored temperature with a value of 32.0 (the freezing point of water in degrees Fahrenheit).
ja: この構造体は、パラメータのないただ１つのイニシャライザ、initを定義します、それは格納された温度を値32.0（華氏度数での水の氷点）で初期化します。

source: The structure is either not captured by any closures, or it’s captured only by nonescaping closures.
ja: その構造体はどんなクロージャによってもキャプチャされない、またはそれは非脱出クロージャによってのみキャプチャされる。

source: The structure is the value of a local variable, not a global variable.
ja: その構造体はローカル変数の値である、グローバル変数ではなく。

source: The structure of the repeat-while loop is better suited to this game than the while loop in the previous example.
ja: repeat-whileループの構造は、前の例でのwhileループよりも更に良くこのゲームに適しています。

source: The structure’s members (including the numberOfEdits property) therefore have an internal access level by default.
ja: 構造体のメンバー（numberOfEditsプロパティを含む）は、したがって特に何もしなければ内部のアクセス水準を持ちます。

source: The subclass in this figure has two designated initializers and one convenience initializer.
ja: この図の中のサブクラスは、２つの指定イニシャライザと１つの便宜イニシャライザを持ちます。

source: The subclass inherits characteristics from the existing class, which you can then refine.
ja: サブクラスは既存のクラスから特徴を受け継ぎます、あなたはそのとき改良することができます。

source: The subclass object is not deallocated until all deinitializers in its inheritance chain have finished executing.
ja: サブクラスオブジェクトは、その継承連鎖の中の全てのデイニシャライザが実行を終えるまで、割り当て解除されません。

source: The subclass’s implementation of that initializer must also be marked with the required modifier.
ja: このイニシャライザのサブクラスでの実装はまた、required修飾子で印されなければなりません。

source: The subclass’s implementation of that initializer must also be marked with the required declaration modifier.
ja: そのイニシャライザのサブクラスの実装もまた、required宣言修飾子で印されなければなりません。

source: The subscript can accept a parameter that’s either a key path or a member name; if you implement both subscripts, the subscript that takes key path argument is used.
ja: 添え字は、あるパラメータを受け入れます、それはキーパスまたはメンバ名のどちらかです；あなたが両方の添え字を実装するならば、キーパス引数をとる添え字が使われます。

source: The subscript on Container returns Item, which means that the type of twelve is also inferred to be Int.
ja: Container上での添え字は、 Itemを返します、それはtwelveの型もまたIntに推論されることを意味します。

source: The subscript returns an optional value of the dictionary’s value type.
ja: 添え字は辞書のもつ値型のオプショナルの値を返します。

source: The subscript takes a single parameter, indices, which is an instance of that Indices type.
ja: この添え字は、ただ１つだけのパラメータ、indicesをとります、それはIndices型のインスタンスです。

source: The subscript’s return type can be any type.
ja: 添え字のもつ戻り型は、どんな型でも可能です。

source: The superclass does not itself have a further superclass, and so rule 1 does not apply.
ja: このスーパークラスにはそれ自身には更にスーパークラスをもちません、なので規則１は適用されません。

source: The superclass’s designated initializer makes sure that all of the superclass properties have a value.
ja: スーパークラスの指定イニシャライザは、スーパークラスのプロパティの全てが値を持つことを確認します。

source: The superclass’s designated initializer now has an opportunity to customize the instance further (although it does not have to).
ja: スーパークラスの指定イニシャライザは、現在、さらにインスタンスを好みに合わせて作り返る機会があります（しかしながら、それはそうしなければならない訳ではない）。

source: The switch cycles between three different power states (off, low and high) every time its next() method is called.
ja: この切替えは、３つの異なる出力状態（off、lowとhigh）の間を、それのnext()メソッドが呼ばれるたびに循環します。

source: The syntax and standard library have been designed based on the guiding principle that the obvious way to write your code should also perform the best.
ja: 構文と標準ライブラリは、明確なやり方であなたのコードを書くことが常に最良を成すべきだという指針に基づいて設計されています。

source: The syntax for creating instances is very similar for both structures and classes:
ja: インスタンスをつくるための構文は、構造体とクラスの両方で非常に類似しています：

source: The syntax for protocol inheritance is similar to the syntax for class inheritance, but with the option to list multiple inherited protocols, separated by commas:
ja: プロトコル継承のための構文は、クラス継承のための構文に似ています、しかし複数の継承されたプロトコルをコンマで区切って列記する選択肢を持ちます：

source: The syntax for string creation and manipulation is lightweight and readable, with a string literal syntax that is similar to C. String concatenation is as simple as combining two strings with the + operator, and string mutability is managed by choosing between a constant or a variable, just like any other value in Swift.
ja: 文字列の作成と操作のための構文は、軽量で、読みやすく、Cに類似した文字列リテラル構文をもちます。文字列の連結は、２つの文字列を+演算子を使って繋ぎ合わせるくらい単純です、そして、文字列が変更可能かどうかは、スウィフトの他あらゆる値と同じように、定数または変数のどちらかを選ぶことによって管理されます。

source: The syntax used in the examples above marks the enumeration as conforming to the CaseIterable [https://developer.apple.com/documentation/swift/caseiterable] protocol.
ja: 上の例において使われる構文は、列挙をCaseIterable [https://developer.apple.com/documentation/swift/caseiterable]プロトコルに準拠するように印します。

source: The synthesized storage for the wrapper has an access control level of private.
ja: ラッパーのために合成されたストレージは、privateのアクセス制御水準を持ちます。

source: The tenant property is optional because an apartment may not always have a tenant.
ja: アパートには常に賃借人がいるわけではないので、tenant（テナント、賃借人）プロパティはオプショナルです。

source: The ternary conditional operator is shorthand for the code below:
ja: 三項条件演算子は、下のコードの短縮形です：

source: The ternary conditional operator provides an efficient shorthand for deciding which of two expressions to consider.
ja: 三項条件演算子は、２つの式のどちらを考慮するべきか決定することについての効果的な短縮形を提供します。

source: The third Rect initializer, init(center:size:), is slightly more complex.
ja: 第３のRectイニシャライザ、init(center:size:)は、わずかにより複雑です。

source: The third and final class in the hierarchy is a subclass of RecipeIngredient called ShoppingListItem.
ja: この階層構造の中の３番目の最後のクラスは、ShoppingListItemと呼ばれるRecipeIngredientのサブクラスです。

source: The third and fourth requirements combine to mean that the items in anotherContainer can also be checked with the != operator, because they’re exactly the same type as the items in someContainer.
ja: ３番目と４番目の要件は組み合わされて、anotherContainerの中の項目が!=演算子を使って確認されることが同様に可能なことを意味します、なぜなら、それらはsomeContainerの中の項目と同じ正確に型であるからです。

source: The third call fails, because the testScores dictionary does not contain a key for "Brian".
ja: ３番目の呼び出しは失敗します、なぜなら、testScores辞書は"Brian"のキーを含んでいないからです。

source: The third form is used to access an initializer of the superclass.
ja: 第３の形式は、スーパークラスのイニシャライザにアクセスするために使われます。

source: The third property, street, is used to name the street for that address:
ja: 第３のプロパティ、streetは、そのアドレスの通りのために使われます：

source: The three switch cases declare placeholder constants x and y, which temporarily take on one or both tuple values from anotherPoint.
ja: ３つのswitchケース節はプレースホルダ定数xとyを宣言します、それは、一時的にanotherPointから１つまたは両方のタプル値を引き受けます。

source: The three switch cases declare placeholder constants x and y, which temporarily take on the two tuple values from yetAnotherPoint.
ja: ３つのswitchケース節はプレースホルダ定数xとyとを宣言します、それは、一時的に２つタプル値をyetAnotherPointから引き受けます。

source: The three code snippets below define a hierarchy of classes and an array containing instances of those classes, for use in an example of type casting.
ja: 下の３つのコードの断片は、型キャストの例で使うために、あるクラス階層とそれらのクラスのインスタンスを含んでいる配列を定義します。

source: The tokens =, ->, //, /*, */, ., the prefix operators <, &, and ?, the infix operator ?, and the postfix operators >, !, and ? are reserved.
ja: トークン=、->、//、/*、*/、.、接頭辞演算子<、&、および?、そして接中辞演算子?、そして接尾辞演算子>、!、および?は予約されます。

source: The top item in the stack is popped.
ja: スタックでの一番上の項目がポンと取り出され（ポップされ）ます。

source: The top-level code in a Swift source file consists of zero or more statements, declarations, and expressions.
ja: あるスウィフトソースコードにおけるトップレベル・コードは、０個以上の文、宣言、そして式から成ります。

source: The trailing closure is understood as an argument to the function, added after the last parenthesized argument.
ja: 後付クロージャは関数に対する引数として理解されます、そして、最後に括弧に入れた引数の後に加えられます。

source: The two containers to be checked don’t have to be the same type of container (although they can be), but they do have to hold the same type of items.
ja: 調べられる２つのコンテナは、同じ型のコンテナである必要はありません（とは言えそうでもよい）、しかしそれらは同じ型の項目を持たなければなりません。

source: The two write accesses refer to the same memory and they overlap, producing a conflict.
ja: ２つの書き込みアクセスは同じメモリを参照してそれらはオーバーラッブして、衝突を生み出しています。

source: The type Optional<Wrapped> is an enumeration with two cases, none and some(Wrapped), which are used to represent values that may or may not be present.
ja: 型Optional<Wrapped>は、noneとsome(Wrapped)、２つのケース節をもつ列挙です、それは、存在しているかもしれないししていないかもしれない値を表わすために使われます。

source: The type alias can provide concrete types for some or all of the generic parameters of the existing type.
ja: 型エイリアスは、既存の型の総称体パラメータの一部またはすべてに具象型を提供できます。

source: The type annotation (: type) is optional in a constant declaration when the type of the constant name can be inferred, as described in Type Inference.
ja: 定数名の型が推論されることができるとき、型推論で記述されるように、型注釈（: type）は定数宣言において任意です。

source: The type arguments are instead inferred from the type of the arguments passed to the function or initializer.
ja: 型引数は、その代わりに関数またはイニシャライザに渡される引数の型から推論されます。

source: The type check operator returns true if the instance is of that subclass type and false if it is not.
ja: 型確認演算子はそのインスタンスがそのサブクラス型ならばtrueを、それがそうでないならばfalseを返します。

source: The type method can be used as an infix operator between existing Vector2D instances:
ja: この型メソッドは既存のVector2Dインスタンスの間で接中辞演算子として使われることができます：

source: The type must implement a subscript(dynamicMemberLookup:) subscript.
ja: この型は、subscript(dynamicMemberLookup:)添え字を実装しなければなりません。

source: The type must implement either a dynamicallyCall(withArguments:) method, a dynamicallyCall(withKeywordArguments:) method, or both.
ja: その型は、dynamicallyCall(withArguments:)、dynamicallyCall(withKeywordArguments:)メソッドのどちらか、または両方を実装しなければなりません。

source: The type of directionToHead is already known, and so you can drop the type when setting its value.
ja: directionToHeadの型はすでに知られています、それでその値を設定するとき、あなたは型を省くことができます。

source: The type of directionToHead is inferred when it’s initialized with one of the possible values of CompassPoint.
ja: directionToHeadの型は、それがCompassPointの可能な値のうちの１つで初期化されるとき、推論されます。

source: The type of newValue is the same as the return value of the subscript.
ja: newValueの型は、添え字の戻り値と同じものです。
